uhnp/src/Reports/ГрафическийОтчетСвязейОтчетов/ГрафическийОтчетСвязейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ГрафическийОтчетСвязейОтчетов</name>
</mdclass:Report>

uhnp/src/InformationRegisters/ТаблицаЗависимостейПоказателей/ТаблицаЗависимостейПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаблицаЗависимостейПоказателей</name>
  <dimensions>
    <name>ПоказательОтчета</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеРасчетов</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
      <types>CatalogRef.ПараметрическоеУсловие</types>
      <types>CatalogRef.ПравилаОбработки</types>
      <types>CatalogRef.ПравилаЗаполненияОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотребительРасчета</name>
    <type>
      <types>CatalogRef.ПоказателиОбъектовБД</types>
      <types>CatalogRef.ПараметрическоеУсловие</types>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СдвигПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/НазначенияУниверсальныхПроцессов/НазначенияУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияУниверсальныхПроцессов</name>
  <enumValues>
    <name>МаршрутСогласования</name>
  </enumValues>
  <enumValues>
    <name>ПроцессПодготовкиОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйПроцесс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ЭтапыУниверсальныхПроцессов/ЭтапыУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыУниверсальныхПроцессов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ШаблоныУниверсальныхПроцессов</owners>
  <attributes>
    <name>УсловияСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочернийМаршрут</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДочернимМаршрутом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйПереход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеСогласованиеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеОтклонениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипыЭтаповУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>УтверждающиеИмеютПравоРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОрганизацийЭтапа</name>
    <type>
      <types>EnumRef.ТипыОрганизационныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийУтвержденияЭтапа</name>
    <type>
      <types>EnumRef.КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПоРасписанию</name>
    <type>
      <types>EnumRef.ДействияЭтапаПоРасписанию</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеАвтоматическогоВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационныеЕдиницыОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласованияОбъекта</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СтатусыПоказателей</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СтатусыТранзакций</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
      <types>EnumRef</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУтверждениеЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДоступностиРеквизитов</name>
    <type>
      <types>CatalogRef.СхемаДоступностиРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автоутверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НайденыОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриСогласовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриОтклонении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизационныеЕдиницыОтбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтоматическиеДействия</name>
    <type>
      <types>EnumRef.УдалитьАвтоматическиеДействияЭтапаПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПараметры</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияУсловийОтборов</name>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормируемыеДокументы</name>
    <attributes>
      <name>ДокументБД</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>DefinedType.ШаблонДокументаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрольный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОбязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовЭтапа</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика1</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика2</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика3</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПредшественники</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыДляОтклонения</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияПараметров</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтбораПараметра</name>
      <type>
        <types>String</types>
        <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметраДоТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеСписка</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникСсылка</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Утверждающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РасширеннаяАдресацияСогласования</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАдресации</name>
      <type>
        <types>EnumRef.СпособыАдресацииСогласования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Reports/ГрафическийОтчетСвязейОтчетов/Forms/ФормаОтчетаУправляемая/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ.
//

&НаСервере
Процедура СформироватьТаблицу(МассивОтчетов,РабочийОбъект)
	
	
	
	ТекМассивОтчетов = ОбщегоНазначенияУХ.СкопироватьУниверсальнуюКоллекцию(МассивОтчетов);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаЗависимостейПоказателей.ПоказательОтчета.Владелец КАК ВидОтчета,
	|	ТаблицаЗависимостейПоказателей.ВидОтчета КАК ВидОтчетаДочерний,
	|	NULL КАК РучнаяКорректировка,
	|	ИСТИНА КАК ПризнакВидОтчета
	|ИЗ
	|	РегистрСведений.ТаблицаЗависимостейПоказателей КАК ТаблицаЗависимостейПоказателей
	|ГДЕ
	|	ТаблицаЗависимостейПоказателей.ПоказательОтчета.Владелец В(&Ссылка)
	|	И НЕ ТаблицаЗависимостейПоказателей.ПоказательОтчета.Владелец = ТаблицаЗависимостейПоказателей.ВидОтчета
	|ИТОГИ ПО
	|	ВидОтчета");
	
	Запрос.УстановитьПараметр("Ссылка", ТекМассивОтчетов);
	
	ЗапросРО = Новый Запрос;
	ЗапросРО.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОперандыПоказателей.ПоказательОтбор.Владелец КАК ВидОтчета
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ОперандыПоказателей
	|ГДЕ
	|	ОперандыПоказателей.НазначениеРасчетов = &Ссылка
	|	И (НЕ ОперандыПоказателей.ПометкаУдаления)";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекМассивОтчетов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ВыборкаДочернихОтчетов = Выборка.Выбрать();
		Пока ВыборкаДочернихОтчетов.Следующий() Цикл 
			
			Если ВыборкаДочернихОтчетов.ПризнакВидОтчета Тогда
				ТекДочернийОбъект = ВыборкаДочернихОтчетов.ВидОтчетаДочерний;
			Иначе
				ТекДочернийОбъект = ВыборкаДочернихОтчетов.РучнаяКорректировка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекДочернийОбъект) Тогда
				Если РабочийОбъект.мОбщийМассивОтчетов.Найти(ТекДочернийОбъект) = Неопределено Тогда
					РабочийОбъект.мОбщийМассивОтчетов.Добавить(ТекДочернийОбъект);
					Если ВыборкаДочернихОтчетов.ПризнакВидОтчета Тогда
						ТекМассивОтчетов.Добавить(ТекДочернийОбъект);
					КонецЕсли;
					СтрокаОтчета = РабочийОбъект.мТаблицаОтчетов.Добавить();
					СтрокаОтчета.ОтчетыПредшественники = Новый ТаблицаЗначений;
					СтрокаОтчета.ОтчетыПредшественники.Колонки.Добавить("ОтчетПредшественник");
					СтрокаОтчета.Отчет = ТекДочернийОбъект;
					СтрокаОтчета.ПризнакВидОтчета = ВыборкаДочернихОтчетов.ПризнакВидОтчета;
				Иначе
					СтрокаОтчета = РабочийОбъект.мТаблицаОтчетов.Найти(ТекДочернийОбъект, "Отчет");
				КонецЕсли;
				
				Если СтрокаОтчета <> Неопределено Тогда
					Если ВыборкаДочернихОтчетов.ПризнакВидОтчета Тогда
						СтрокаОтчета.ОтчетыПредшественники.Добавить().ОтчетПредшественник = Выборка.ВидОтчета;
					Иначе
						СтрокаВидаОтчета = РабочийОбъект.МТаблицаОтчетов.Найти(Выборка.ВидОтчета, "Отчет");
						Если СтрокаВидаОтчета <> Неопределено Тогда
							СтрокаВидаОтчета.ОтчетыПредшественники.Добавить().ОтчетПредшественник = ТекДочернийОбъект;
						КонецЕсли;
						
						ЗапросРО.УстановитьПараметр("Ссылка", ТекДочернийОбъект);
						ВыборкаОтчетов = ЗапросРО.Выполнить().Выбрать();
						
						Пока ВыборкаОтчетов.Следующий() Цикл
							Если РабочийОбъект.мОбщийМассивОтчетов.Найти(ВыборкаОтчетов.ВидОтчета) = Неопределено Тогда
								РабочийОбъект.мОбщийМассивОтчетов.Добавить(ВыборкаОтчетов.ВидОтчета);
								ТекМассивОтчетов.Добавить(ВыборкаОтчетов.ВидОтчета);
								СтрокаВидаОтчета = РабочийОбъект.мТаблицаОтчетов.Добавить();
								СтрокаВидаОтчета.ОтчетыПредшественники = Новый ТаблицаЗначений;
								СтрокаВидаОтчета.ОтчетыПредшественники.Колонки.Добавить("ОтчетПредшественник");
								СтрокаВидаОтчета.Отчет = ВыборкаОтчетов.ВидОтчета;
								СтрокаВидаОтчета.ПризнакВидОтчета = Истина;
							КонецЕсли;
							
							Если СтрокаОтчета.ОтчетыПредшественники.Найти(ВыборкаОтчетов.ВидОтчета, "ОтчетПредшественник") = Неопределено Тогда
								СтрокаОтчета.ОтчетыПредшественники.Добавить().ОтчетПредшественник = ВыборкаОтчетов.ВидОтчета;
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТекМассивОтчетов.Количество() > 0 Тогда
		СформироватьТаблицу(ТекМассивОтчетов,РабочийОбъект);
	КонецЕсли;
	
	Для Индекс=0 ПО РабочийОбъект.мТаблицаОтчетов.Количество()-1 Цикл
		
		Строка=РабочийОбъект.мТаблицаОтчетов[Индекс];
		
		
		РассчитатьУровеньX(Строка, РабочийОбъект.мТаблицаОтчетов, Новый Массив);
	КонецЦикла;
	
КонецПроцедуры

// Процедура рассчитывает уровень показателя по оси Х.
//
&НаСервере
Процедура РассчитатьУровеньX(СтрокаТаблицы, Таблица, МассивПройденныхОтчетов)
	
	ТекМассив = ОбщегоНазначенияУХ.СкопироватьУниверсальнуюКоллекцию(МассивПройденныхОтчетов);
	ТекМассив.Добавить(СтрокаТаблицы.Отчет);
	
	Если Не СтрокаТаблицы.УровеньХ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТаблицы.ОтчетыПредшественники.Колонки.Найти("СтрокаОтчетаПредшественника")=Неопределено Тогда
		
		СтрокаТаблицы.ОтчетыПредшественники.Колонки.Добавить("СтрокаОтчетаПредшественника");
		
	КонецЕсли;
	
	Если СтрокаТаблицы.ОтчетыПредшественники.Количество()>0 Тогда
		МаксУровень = 0;
		
		Для Индекс=0 ПО СтрокаТаблицы.ОтчетыПредшественники.Количество()-1 Цикл
			
			СтрокаПредшественника=СтрокаТаблицы.ОтчетыПредшественники[Индекс];
			
			СтрокаПредшественника.СтрокаОтчетаПредшественника = Таблица.Найти(СтрокаПредшественника.ОтчетПредшественник, "Отчет");
			Если ТекМассив.Найти(СтрокаПредшественника.ОтчетПредшественник) <> Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			РассчитатьУровеньX(СтрокаПредшественника.СтрокаОтчетаПредшественника, Таблица, ТекМассив);
			МаксУровень = Макс(МаксУровень, ?(СтрокаПредшественника.СтрокаОтчетаПредшественника.УровеньХ=Неопределено,0,СтрокаПредшественника.СтрокаОтчетаПредшественника.УровеньХ));
			
		КонецЦикла;
		
		СтрокаТаблицы.УровеньХ = МаксУровень + 1;
		
	Иначе
		
		СтрокаТаблицы.УровеньХ = 0;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция определяет допустимую позицию по оси Y.
//
&НаСервере
Функция ОпределитьНовуюПозициюВУровнеY(СтрокаПоказателя, ЗанятыеУровниПоУ, Предпочтение = Неопределено)
	
	Если Не Предпочтение = Неопределено и ПолучитьДанныеУровня(ЗанятыеУровниПоУ,Предпочтение) = Неопределено Тогда
		Результат = Предпочтение;
	Иначе
		Результат = 0;
		
		Пока Не ПолучитьДанныеУровня(ЗанятыеУровниПоУ,Результат) = Неопределено Цикл
			Результат = Результат + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	ДобавитьВТаблицуУровней(ЗанятыеУровниПоУ,Результат,Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуУровней()
	
	ТаблицаУровней=Новый ТаблицаЗначений;
	ТаблицаУровней.Колонки.Добавить("Ключ");
	ТаблицаУровней.Колонки.Добавить("Значение");
	
	Возврат ТаблицаУровней;	
	
КонецФункции // ПодготовитьТаблицуУровней()

&НаСервере
Процедура ДобавитьВТаблицуУровней(ТаблицаУровней,Ключ,Значение)
	
	НоваяСтрока=ТаблицаУровней.Добавить();
	НоваяСтрока.Ключ=Ключ;
	НоваяСтрока.Значение=Значение;
	
КонецПроцедуры // ДобавитьВТаблицуУровней() 

&НаСервере
Процедура ПодготовитьТаблицуОтчетов(РабочийОбъект)
	
	
	
	РабочийОбъект.мТаблицаОтчетов.Сортировать("УровеньХ, КоличествоПредшественников");
	
	Уровни = Новый Структура("Х, У", ПодготовитьТаблицуУровней(), ПодготовитьТаблицуУровней());
	УровеньХ = 0;
	СтрокиУровня = РабочийОбъект.мТаблицаОтчетов.НайтиСтроки(Новый Структура("УровеньХ", УровеньХ));
	
	Пока СтрокиУровня.Количество() Цикл
		СтруктураХ = Новый Структура("ОтступХ, ЗанятыеУровниПоУ", 0, ПодготовитьТаблицуУровней());
		
		ДобавитьВТаблицуУровней(Уровни.Х,УровеньХ,СтруктураХ);
		
		УровеньУ = -1;
		
		Для Индекс=0 ПО СтрокиУровня.Количество()-1 Цикл
			
			СтрокаОтчета=СтрокиУровня[Индекс];
			
			СтрокаОтчета.ОтчетыПредшественники.Колонки.Добавить("ОтступХ", Новый ОписаниеТипов("Число"));
			СтрокаОтчета.ОтчетыПредшественники.Колонки.Добавить("ОтступУ", Новый ОписаниеТипов("Число"));
			Если СтрокаОтчета.ОтчетыПредшественники.Количество() = 0 ИЛИ УровеньХ=0 Тогда
				УровеньУ = УровеньУ + 1;
			Иначе
				
				Если СтрокаОтчета.ОтчетыПредшественники.Количество() = 1 Тогда
					Предпочтение =СтрокаОтчета.ОтчетыПредшественники[0].СтрокаОтчетаПредшественника.УровеньУ;
				Иначе
					Предпочтение = Неопределено;
				КонецЕсли;
				
				УровеньУ = ОпределитьНовуюПозициюВУровнеY(СтрокаОтчета, СтруктураХ.ЗанятыеУровниПоУ, Предпочтение);
				
				Для Индекс1=0 ПО СтрокаОтчета.ОтчетыПредшественники.Количество()-1 Цикл
					
					СтрокаПредшественника=СтрокаОтчета.ОтчетыПредшественники[Индекс1];
					
					
					СтруктураХ.ОтступХ = СтруктураХ.ОтступХ + 1;
					
					Если Не СтрокаОтчета.УровеньХ = СтрокаПредшественника.СтрокаОтчетаПредшественника.УровеньХ + 1 Тогда
						
						СтруктураУ=ПолучитьДанныеУровня(Уровни.У,?(СтрокаПредшественника.СтрокаОтчетаПредшественника.УровеньУ=Неопределено,0,СтрокаПредшественника.СтрокаОтчетаПредшественника.УровеньУ));
						СтруктураУ.ОтступУ = СтруктураУ.ОтступУ + 1;
						СтрокаПредшественника.ОтступУ = СтруктураУ.ОтступУ;
						
					КонецЕсли;
					
					СтрокаПредшественника.ОтступХ = СтруктураХ.ОтступХ;
					
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураУ=ПолучитьДанныеУровня(Уровни.У,УровеньУ);
			
			Если СтруктураУ = Неопределено Тогда
				
				СтруктураУ = Новый Структура("ОтступУ", 0);
				
				ДобавитьВТаблицуУровней(Уровни.У,УровеньУ,СтруктураУ);
				
			КонецЕсли;
			
			СтрокаОтчета.УровеньУ = УровеньУ;
			
		КонецЦикла;
		
		УровеньХ = УровеньХ + 1;
		СтрокиУровня = РабочийОбъект.мТаблицаОтчетов.НайтиСтроки(Новый Структура("УровеньХ", УровеньХ));
	КонецЦикла;
	
	ВывестиТаблицу(Уровни,РабочийОбъект);
	
КонецПроцедуры

// Процедура выводит диаграмму этапов в поле табличного документа
//
&НаСервере
Процедура ВывестиТаблицу(Уровни,РабочийОбъект)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЛевоЭтапа = ШиринаОтступа;
	
	Для Индекс=0 ПО Уровни.Х.Количество()-1 Цикл
		
		СтруктураХ=Уровни.Х[Индекс];
		
		
		Если СтруктураХ.Ключ Тогда
			ЛевоЭтапа = ЛевоЭтапа + Макс(СтруктураХ.Значение.ОтступХ + 1, 2) * ШиринаОтступа + ШиринаЭтапа;
		КонецЕсли;
		
		СтруктураХ.Значение.Вставить("ЛевоЭтапа", ЛевоЭтапа);
		
	КонецЦикла;
	
	ВерхЭтапа = ВысотаОтступа;
	
	Для Индекс=0 ПО Уровни.У.Количество()-1 Цикл
		
		СтруктураУ=Уровни.У[Индекс];
		
		Если СтруктураУ.Ключ Тогда
			
			ДанныеУровня=ПолучитьДанныеУровня(Уровни.У,СтруктураУ.Ключ - 1);
			
			ВерхЭтапа = ВерхЭтапа + Макс(ДанныеУровня.ОтступУ + 1, 1) * ВысотаОтступа + ВысотаЭтапа;
		КонецЕсли;
		
		СтруктураУ.Значение.Вставить("ВерхЭтапа", ВерхЭтапа);
		
	КонецЦикла;
	
	Для Индекс=0 ПО Уровни.Х.Количество()-1 Цикл
		
		СтруктураХ=Уровни.Х[Индекс];
		
		СтрокиУровня = РабочийОбъект.мТаблицаОтчетов.НайтиСтроки(Новый Структура("УровеньХ", СтруктураХ.Ключ));
		
		Для ИндексСтроки=0 ПО СтрокиУровня.Количество()-1 Цикл
			
			Строка=СтрокиУровня[ИндексСтроки];
			
			
			НарисоватьСвязи(ТабличныйДокумент, Строка, Уровни);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Индекс=0 ПО Уровни.Х.Количество()-1 Цикл
		
		СтруктураХ=Уровни.Х[Индекс];
		
		СтрокиУровня = РабочийОбъект.мТаблицаОтчетов.НайтиСтроки(Новый Структура("УровеньХ", СтруктураХ.Ключ));
		
		Для ИндексСтроки=0 ПО СтрокиУровня.Количество()-1 Цикл
			
			Строка=СтрокиУровня[ИндексСтроки];
			
			
			НарисоватьУзел(ТабличныйДокумент, Строка, Уровни);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПолеОтчета.Очистить();
	
	ПолеОтчета.Вывести(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеУровня(ТаблицаУровней,Ключ)
	
	СтрокаУровня=ТаблицаУровней.Найти(Ключ,"Ключ");
	
	Если СтрокаУровня=Неопределено Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат СтрокаУровня.Значение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьСтрокуУровня() 

// Процедура рисует этап на поле табличного документа
//
&НаСервере
Процедура НарисоватьУзел(ТабличныйДокумент, Строка, Уровни)
	
	ВерхЭтапа = ПолучитьДанныеУровня(Уровни.У,Строка.УровеньУ).ВерхЭтапа;
	
	ЛевоЭтапа = ПолучитьДанныеУровня(Уровни.Х,Строка.УровеньХ).ЛевоЭтапа;
	
	Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямоугольник);
	
	Рисунок.Лево = ЛевоЭтапа + 1;
	Рисунок.Верх = ВерхЭтапа + 1;
	Рисунок.Ширина = ШиринаЭтапа + 1;
	Рисунок.Высота = ВысотаЭтапа + 1;
	
	Рисунок.ЦветФона  = Новый Цвет(192, 192, 192);
	Рисунок.ЦветЛинии = Рисунок.ЦветФона;
	
	
	ЦветЛинии = Новый Цвет(128, 0, 0);
	
	Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Рисунок.Лево = ЛевоЭтапа;
	Рисунок.Верх = ВерхЭтапа;
	Рисунок.Ширина = ШиринаЭтапа;
	Рисунок.Высота = ВысотаЭтапа;
	
	Рисунок.ЦветФона  = ?(Строка.ПризнакВидОтчета, Новый Цвет(255, 248, 224), Новый Цвет(230, 230, 250));
	Рисунок.ЦветУзора = Новый Цвет(255, 240, 192);
	Рисунок.Узор      = ТипУзораТабличногоДокумента.Узор17;
	
	Рисунок.ЦветЛинии = ЦветЛинии;
	Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Точечная, 1);
	
	Рисунок.Расшифровка = Строка.Отчет;
	Рисунок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	Рисунок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Рисунок.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	Рисунок.Текст                   = Строка.Отчет.Наименование;
	Рисунок.Шрифт = Новый Шрифт(Рисунок.Шрифт, , , Истина);
	
КонецПроцедуры

// Процедура рисует связи этапа на поле табличного документа
//
&НаСервере
Процедура НарисоватьСвязи(ТабличныйДокумент, Строка, Уровни)
	
	ВерхЭтапа = ПолучитьДанныеУровня(Уровни.У,Строка.УровеньУ).ВерхЭтапа;	
	ЛевоЭтапа = ПолучитьДанныеУровня(Уровни.Х,Строка.УровеньХ).ЛевоЭтапа;
	
	Для Индекс=0 ПО Строка.ОтчетыПредшественники.Количество()-1 Цикл
		
		СтрокаПредшественника=Строка.ОтчетыПредшественники[Индекс];
		
		СтрокаОтчетаПредшественника = СтрокаПредшественника.СтрокаОтчетаПредшественника;
		
		ВерхПредшественника = ПолучитьДанныеУровня(Уровни.У,СтрокаОтчетаПредшественника.УровеньУ).ВерхЭтапа;	
		ЛевоПредшественника = ПолучитьДанныеУровня(Уровни.Х,СтрокаОтчетаПредшественника.УровеньХ).ЛевоЭтапа;
		
		
		Расшифровка = Новый Структура("Отчет, ОтчетПредшественник", Строка.Отчет, СтрокаОтчетаПредшественника.Отчет);
		Флаг = ?(СтрокаОтчетаПредшественника.УровеньУ > Строка.УровеньУ, -1, 1);
		Если СтрокаОтчетаПредшественника.УровеньХ + 1 = Строка.УровеньХ Тогда
			ЛевоЛинии   = ЛевоПредшественника + ШиринаЭтапа;
			ВерхЛинии   = ВерхПредшественника + ВысотаЭтапа / 4;
			
			НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ЛевоЭтапа - ЛевоЛинии - СтрокаПредшественника.ОтступХ*ШиринаОтступа - ШиринаИзгиба, 0);
			Если СтрокаОтчетаПредшественника.УровеньУ = Строка.УровеньУ Тогда
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, ШиринаИзгиба);
				НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, 0, ВысотаЭтапа / 2 - ШиринаИзгиба * 2);
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, ШиринаИзгиба);
			Иначе
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, Флаг * ШиринаИзгиба);
				НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, 0, ВерхЭтапа + ВысотаЭтапа / 4 * 3 - ВерхЛинии - Флаг * ШиринаИзгиба);
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, Флаг * ШиринаИзгиба);
			КонецЕсли;
			
			НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ЛевоЭтапа - ЛевоЛинии, 0);
			НарисоватьСтрелку(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии);
			
		Иначе
			
			ЛевоЛинии   = ЛевоПредшественника + ШиринаЭтапа / 4 * 3;
			ВерхЛинии   = ВерхПредшественника + ВысотаЭтапа;
			
			НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, 0, ВысотаОтступа* СтрокаПредшественника.ОтступУ - ШиринаИзгиба);
			НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, ШиринаИзгиба);
			
			НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ЛевоЭтапа - ЛевоЛинии - СтрокаПредшественника.ОтступХ*ШиринаОтступа - ШиринаИзгиба, 0);
			
			Если СтрокаОтчетаПредшественника.УровеньУ = Строка.УровеньУ Тогда
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, - ШиринаИзгиба);
				НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, 0, ВерхЭтапа + ВысотаЭтапа / 4 * 3 - ВерхЛинии + ШиринаИзгиба);
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, - ШиринаИзгиба);
			Иначе
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, Флаг * ШиринаИзгиба);
				НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, 0, ВерхЭтапа + ВысотаЭтапа / 4 * 3 - ВерхЛинии - Флаг * ШиринаИзгиба);
				НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаИзгиба, Флаг * ШиринаИзгиба);
			КонецЕсли;
			
			НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ЛевоЭтапа - ЛевоЛинии, 0);
			НарисоватьСтрелку(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии);
			
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция выводит рисунок типа "текст" в табличный документ 
//
&НаСервере
Функция НарисоватьТекст(ТабличныйДокумент, Текст, Расшифровка,ЦветЛинии, Лево, Верх, Ширина, Высота)
	
	Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Рисунок.Лево   = Лево;
	Рисунок.Верх   = Верх;
	Рисунок.Ширина = Ширина;
	Рисунок.Высота = Высота;
	
	Рисунок.Расшифровка = Расшифровка;
	Рисунок.Текст = Текст;
	Рисунок.ЦветЛинии = ЦветЛинии;
	Возврат Рисунок;
	
КонецФункции // ()

// Функция выводит рисунок типа "линия" в табличный документ
//
&НаСервере
Процедура НарисоватьЛинию(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаЛинии, ВысотаЛинии);
	
	Линия = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.Лево        = ЛевоЛинии;
	Линия.Верх        = ВерхЛинии;
	Линия.Ширина      = ШиринаЛинии;
	Линия.Высота      = ВысотаЛинии;
	Линия.ЦветЛинии   = Новый Цвет(128, 0, 0);
	Линия.Расшифровка = Расшифровка;
	Линия.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	
	ЛевоЛинии = ЛевоЛинии + ШиринаЛинии;
	ВерхЛинии = ВерхЛинии + ВысотаЛинии;
	
КонецПроцедуры

// Функция выводит рисунок из линий, в виде изгиба, в табличный документ
//
&НаСервере
Процедура НарисоватьИзгиб(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии, ШиринаЛинии, ВысотаЛинии);
	
	Отступ = 0.1;
	СдвигЛево = ?(ШиринаЛинии > 0, Отступ, -Отступ);
	СдвигВерх = ?(ВысотаЛинии > 0, Отступ, -Отступ);
	
	Линия = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.ЦветЛинии   = Новый Цвет(128, 0, 0);
	Линия.Лево   = ЛевоЛинии + СдвигЛево;
	Линия.Верх   = ВерхЛинии + СдвигВерх;
	Линия.Ширина = ШиринаЛинии - СдвигЛево * 2;
	Линия.Высота = ВысотаЛинии - СдвигВерх * 2;
	
	Линия.Расшифровка = Расшифровка;
	Линия.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	
	ЛевоЛинии = ЛевоЛинии + ШиринаЛинии;
	ВерхЛинии = ВерхЛинии + ВысотаЛинии;
	
КонецПроцедуры

// Функция выводит рисунок из линий, в виде стрелки, в табличный документ
//
&НаСервере
Процедура НарисоватьСтрелку(ТабличныйДокумент, Расшифровка, ЛевоЛинии, ВерхЛинии)
	
	Линия = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.Лево   = ЛевоЛинии - 2;
	Линия.Верх   = ВерхЛинии - 1.5;
	Линия.Ширина = 1.5;
	Линия.Высота = 1.5;
	
	Линия.Расшифровка = Расшифровка;
	Линия.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	Линия.ЦветЛинии   = Новый Цвет(128, 0, 0);
	
	Линия = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.Лево   = ЛевоЛинии - 2;
	Линия.Верх   = ВерхЛинии + 1.5;
	Линия.Ширина = 1.5;
	Линия.Высота = -1.5;
	
	Линия.Расшифровка = Расшифровка;
	Линия.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	Линия.ЦветЛинии   = Новый Цвет(128, 0, 0);
	
КонецПроцедуры

&НаСервере
Процедура ВнестиДанныеВТабличноеПоле(ТЗОтчетов)
	Если ТипЗнч(ТЗОтчетов) = Тип("ТаблицаЗначений") Тогда
		
		Для Индекс=0 ПО ТЗОтчетов.Количество()-1 Цикл
			
			Элемент=ТЗОтчетов[Индекс];
			
			Если ТабличноеПолеОтчетов.НайтиСтроки(Новый структура("Отчет",Элемент.Отчет)).Количество() = 0 Тогда
				ТабличноеПолеОтчетов.Добавить().Отчет = Элемент.Отчет;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтборов(Параметр)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметр);	
	Запрос.УстановитьПараметр("ОтборОтчетов", РеквизитФормыВЗначение("ТабличноеПолеОтчетов").ВыгрузитьКолонку("Отчет"));
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВидыОтчетов.Ссылка КАК Отчет
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И НЕ ВидыОтчетов.Ссылка В (&ОтборОтчетов)
		|	И ВидыОтчетов.ЭтоГруппа = ЛОЖЬ";
	
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка."+"ЭтапыУниверсальныхПроцессов")
		ИЛИ ТипЗнч(Параметр) = Тип("СправочникСсылка."+"ШаблоныУниверсальныхПроцессов") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЭтапыПроцессовФормируемыеДокументы.ШаблонДокумента КАК Отчет
		|ИЗ
		|	Справочник.ЭтапыУниверсальныхПроцессов.ФормируемыеДокументы КАК ЭтапыПроцессовФормируемыеДокументы
		|ГДЕ";
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка."+"ЭтапыУниверсальныхПроцессов") Тогда
			
			ТекстЗапроса=ТекстЗапроса+"
			|ЭтапыПроцессовФормируемыеДокументы.Ссылка = &Ссылка";
			
		Иначе
			
			ТекстЗапроса=ТекстЗапроса+"
			|ЭтапыПроцессовФормируемыеДокументы.Ссылка.Владелец = &Ссылка";
			
		КонецЕсли;
							
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;				   
	ВнестиДанныеВТабличноеПоле(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаСервере
Процедура ПолеОтчетаОчистить()
	ПолеОтчета.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОчисткиПоля_Завершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТабличноеПолеОтчетов.Очистить();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда	
		Возврат;		// Пользователь отказался от заполнения.
	Иначе
		// Не очищаем поле.
	КонецЕсли;
	ЗаполнитьТаблицуОтборов(ДопПараметры.ОбъектЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПолеИЗаполнитьТаблицуОтчетов(ОбъектЗаполненияВход)
	Если ТабличноеПолеОтчетов.Количество() > 0 Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектЗаполнения", ОбъектЗаполненияВход);
		ТекстВопроса = НСтр("ru = 'Поле отборов не пустое. Очистить?'");
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОчисткиПоля_Завершение", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе
		ЗаполнитьТаблицуОтборов(ОбъектЗаполненияВход);
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.
//
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельОтчетовПоЭтапуПроцесса(Кнопка)
	
	ЭтапПроцесса = Неопределено;
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработатьВыборЭтапаПроцесса", ЭтотОбъект);
		СтрокаПредопределенного = "Перечисление.НазначенияУниверсальныхПроцессов.ПроцессПодготовкиОтчетности";
		НазначениеПроцессПодготовкиОтчетности = ПредопределенноеЗначение(СтрокаПредопределенного);
		СтруктураПараметровФормы = Новый Структура;
		СтруктураПараметровФормы.Вставить("НазначениеПроцесса", НазначениеПроцессПодготовкиОтчетности);
		СтрокаОткрытия = "Справочник.ЭтапыУниверсальныхПроцессов.ФормаВыбора";
		ОткрытьФорму(СтрокаОткрытия, СтруктураПараметровФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Для прочих продуктов не выполяем действий.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьВыборЭтапаПроцесса(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтапПроцесса = Результат;
	Если ЭтапПроцесса <> Неопределено Тогда
		ОчиститьПолеИЗаполнитьТаблицуОтчетов(ЭтапПроцесса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельОтчетовПоШаблонуПроцесса(Кнопка)
	
	ШаблонПроцесса = Неопределено;
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработатьВыборШаблонаПроцесса", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураОтбора = Новый Структура;
		СтрокаПредопределенного = "Перечисление.НазначенияУниверсальныхПроцессов.ПроцессПодготовкиОтчетности";
		НазначениеПроцессПодготовкиОтчетности = ПредопределенноеЗначение(СтрокаПредопределенного);
		СтруктураОтбора.Вставить("НазначениеПроцесса", НазначениеПроцессПодготовкиОтчетности);
		СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
		СтрокаОткрытияФормы = "Справочник.ШаблоныУниверсальныхПроцессов.ФормаВыбора";
		ОткрытьФорму(СтрокаОткрытияФормы, СтруктураПараметров,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Для прочих продуктов не выполяем действий.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьВыборШаблонаПроцесса(Результат, ДополнительныеПараметры) Экспорт
	
	ШаблонПроцесса = Результат;
	
	Если ШаблонПроцесса <> Неопределено Тогда
		ОчиститьПолеИЗаполнитьТаблицуОтчетов(ШаблонПроцесса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельОтчетовПоГруппеОтчетов(Кнопка)
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ЭтоГруппа", Истина));
	ГруппаОтчетов = Неопределено;
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыборГруппыОтчетов", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыОтчетов.ФормаВыбора", 
	ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборГруппыОтчетов(Результат, ДополнительныеПараметры) Экспорт
	
	ГруппаОтчетов = Результат;
	
	Если ГруппаОтчетов <> Неопределено Тогда
		
		ОчиститьПолеИЗаполнитьТаблицуОтчетов(ГруппаОтчетов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОтчетовОтчетНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработатьВыборОтчета", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыОтчетов.ФормаВыбора",
	,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьВыборОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	ВидОтчета = Результат;
	
	Если ВидОтчета <> Неопределено Тогда
		
		Если ТабличноеПолеОтчетов.НайтиСтроки(Новый Структура("Отчет", ВидОтчета)).Количество() = 0 Тогда
			Элементы.ТабличноеПолеОтчетов.ТекущиеДанные.Отчет = ВидОтчета;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПодготовитьПараметрыРасшифровкиСервер();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("мКэшРасшифровокАдрес",	мКэшРасшифровокАдрес);
		СтруктураПараметров.Вставить("ВидОтчета",				Расшифровка.ОтчетПредшественник);
		СтруктураПараметров.Вставить("ВидОтчетаДочерний",		Расшифровка.Отчет);
		
		ОткрытьФорму("Отчет.ГрафическийОтчетСвязейОтчетов.Форма.ФормаРасшифровокУправляемая", СтруктураПараметров, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьПараметрыРасшифровкиСервер()
	
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	РабочийОбъект = РеквизитФормывЗначение("Отчет");
	
	РабочийОбъект.мТаблицаОтчетов.Очистить();
	РабочийОбъект.мОбщийМассивОтчетов = ОбщегоНазначенияУХ.СкопироватьУниверсальнуюКоллекцию(РеквизитФормыВЗначение("ТабличноеПолеОтчетов").ВыгрузитьКолонку("Отчет"));
	Если ТабличноеПолеОтчетов.Количество() > 0 Тогда
		
		
		Для Индекс=0 ПО ТабличноеПолеОтчетов.Количество()-1 Цикл
			
			Строка=ТабличноеПолеОтчетов[Индекс];
			
			НоваяСтрока = РабочийОбъект.мТаблицаОтчетов.Добавить();
			НоваяСтрока.Отчет = Строка.Отчет;
			НоваяСтрока.ПризнакВидОтчета = Истина;
			НоваяСтрока.ОтчетыПредшественники = Новый ТаблицаЗначений;
			НоваяСтрока.ОтчетыПредшественники.Колонки.Добавить("ОтчетПредшественник");
		КонецЦикла;
		
		СформироватьТаблицу(РабочийОбъект.мОбщийМассивОтчетов,РабочийОбъект);
		
	КонецЕсли;
	
	ПодготовитьТаблицуОтчетов(РабочийОбъект);
	
	мКэшРасшифровокАдрес = ПоместитьВоВременноеХранилище(РабочийОбъект.мКэшРасшифровок,новый УникальныйИдентификатор);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШиринаЭтапа   = 35;
	ВысотаЭтапа   = 20;
	ШиринаОтступа = 4;
	ВысотаОтступа = 4;
	ШиринаИзгиба = 1.2;
	
	Если ТипЗнч(Параметры.МассивВидовОтчетов)=Тип("Массив") Тогда
		
		Для Индекс=0 ПО Параметры.МассивВидовОтчетов.Количество()-1 Цикл
			
			ВидОтчета=Параметры.МассивВидовОтчетов[Индекс];
			
			
			НоваяСтрока=ТабличноеПолеОтчетов.Добавить();
			НоваяСтрока.Отчет=ВидОтчета;
			
		КонецЦикла;
		
		СформироватьОтчет();
		
	КонецЕсли;
	
КонецПроцедуры
